Revit 2027 API
FamilyInstance.Room(Phase) Property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Room this[
	Phase phase
] { get; }
Public ReadOnly Property Room (
	phase As Phase
) As Room
	Get
public:
property Room^ Room[Phase^ phase] {
	Room^ get (Phase^ phase);
}
member Room : Room with get
Parameters
phase Phase
Property Value
Room
See Also
Reference
FamilyInstance Class
Room Overload
Autodesk.Revit.DB Namespace